views/layouts/main.php

        ['label' => 'Пользователи', 'url' => ['/users/index']],
    ];
    if (!Yii::$app->user->isGuest) {
        $username = \app\models\User::findOne(Yii::$app->user->id)->username;
---
SELECT * FROM `user` WHERE `id`=1