controllers/UsersController.php

SELECT * FROM `user` WHERE `id` IS NULL
SELECT * FROM `user` WHERE `id`=1
---
    public function actionProfile()
    {
        if (Yii::$app->user->isGuest) {
            Yii::$app->session->setFlash('error', 'Для просмотра профиля пользователя необходимо авторизироваться.');
            return $this->goHome();
        }

        $model = ($model = User::findOne(Yii::$app->request->get('id'))) ? $model : new User();

        if (!isset($_GET['id'])) {
            $model = ($model = User::findOne(Yii::$app->user->id)) ? $model : new User();

SELECT * FROM `picture` WHERE `id`=8
---
        }

        if (Yii::$app->request->post('delete')) {
            $pictureToDelete = ($pictureToDelete = Picture::findOne((int)Yii::$app->request->post('delete'))) ?