models/Picture.php

    public function deletePicture()
    {
        if (!$this->validate()){
            return false;
        }
        $this->status = self::STATUS_DELETED;
        unlink($this->path);
        $this->path = '--empty--';
        return $this->save() ? true : false;
---
UPDATE `picture` SET `path`='--empty--', `status`=0, `updated_at`=1469650013 WHERE `id`=8