models/User.php

    public static function findByEmail($email)
    {
        return static::findOne(['email' => $email, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user` WHERE (`email`='admin@admin.com') AND (`status`=10)